app/src/main/assets/panasonic_param_header.xml

<?xml version="1.0" encoding="utf-8"?>
      <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" s:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <s:Body>
          <body_elem:action_elem xmlns:body_elem="urn:urn_elem">
            params_elem
          </body_elem:action_elem>
        </s:Body>
      </s:Envelope>